app/controllers/api/v1/accounts_controller.rb

SELECT  `account`.* FROM `account` LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `account`
---
    def index
      @accounts = Realms::Account.all.page(params[:page]).per(params[:per_page])

SELECT  `account`.* FROM `account` WHERE `account`.`id` = 1 LIMIT 1
---
    def show
      @accounts = Realms::Account.find params[:id]

INSERT INTO `account` (`username`, `sha_pass_hash`, `gmlevel`, `email`, `joindate`, `os`) VALUES ('testaccount', 'a34b29541b87b7e4823683ce6c7bf6ae68beaaac', 3, '', '2016-04-28 17:16:13', 'OSX')
---
    def create
      @account = Realms::Account.create! account_params

SELECT  `account`.* FROM `account` WHERE `account`.`id` = 1 LIMIT 1
UPDATE `account` SET `email` = 'test@test.com', `os` = 'OSX' WHERE `account`.`id` = 1
---
    def update
      @account = Realms::Account.find params[:id]
      @account.update! account_params

SELECT  `account`.* FROM `account` WHERE `account`.`id` = 4 LIMIT 1
DELETE FROM `account` WHERE `account`.`id` = 4
---
    def destroy
      @account = Realms::Account.find params[:id]
      @account.destroy!